'''
Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. 
Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
Каждое число вводится с новой строки.
Ввод: 7 2 5
Вывод: 7 9 11 13 15
'''

first_num = int(input("Укажите первое число: "))
increment = int(input("Укажите разность элементов: "))
count_of_numbers = int(input("Укажите количество элементов: "))
result = first_num
i = 0
while i <= count_of_numbers:
    print(result, end = ' ')
    result += increment
    i += 1
